Repository: cryptexctl/apkg
Catalog: Sources/apkg/Resources/*.lproj/Localizable.strings
Languages: ru

source: Usage: apkg <command> [package]
ru: Использование: apkg <команда> [пакет]

source: Package name required
ru: Требуется имя пакета

source: Search query required
ru: Требуется поисковый запрос

source: Unknown command: %@
ru: Неизвестная команда: %@

source: APKG - macOS package manager
ru: APKG - пакетный менеджер для macOS

source: Usage:
ru: Использование:

source: Commands:
ru: Команды:

source: install <package> Install package
ru: install <пакет> Установка пакета

source: remove <package> Remove package
ru: remove <пакет> Удаление пакета

source: list List installed packages
ru: list Список установленных пакетов

source: search <query> Search packages
ru: search <запрос> Поиск пакетов

source: info <package> Show package info
ru: info <пакет> Информация о пакете

source: update Update packages
ru: update Обновление пакетов

source: help Show this help
ru: help Показать эту справку

source: register Register with system
ru: register Регистрация в системе

source: unregister Unregister from system
ru: unregister Удаление из системы

source: install-agent Install update agent
ru: install-agent Установка агента обновления

source: uninstall-agent Uninstall update agent
ru: uninstall-agent Удаление агента обновления

source: Note: All commands require sudo privileges
ru: Примечание: Все команды требуют прав суперпользователя (sudo)

source: Package %@ is already installed
ru: Пакет %@ уже установлен

source: Package file not found: %@
ru: Файл пакета не найден: %@

source: Invalid package: %@
ru: Неверный пакет: %@

source: Package checksum verification failed: %@
ru: Проверка контрольной суммы пакета не удалась: %@

source: Pre-install script failed: %@
ru: Скрипт предустановки не удался: %@

source: Failed to extract package: %@
ru: Не удалось распаковать пакет: %@

source: Post-install script failed: %@
ru: Скрипт постустановки не удался: %@

source: Successfully installed %@ %@
ru: Успешно установлен %@ %@

source: Package %@ is not installed
ru: Пакет %@ не установлен

source: Pre-deinstall script failed: %@
ru: Скрипт предудаления не удался: %@

source: Post-deinstall script failed: %@
ru: Скрипт постудаления не удался: %@

source: Successfully removed %@ %@
ru: Успешно удален %@ %@

source: Package: %@
ru: Пакет: %@

source: Version: %@
ru: Версия: %@

source: Installed: %@
ru: Установлен: %@

source: Updating %@ from %@ to %@
ru: Обновление %@ с %@ до %@

source: Failed to read packages directory
ru: Не удалось прочитать директорию пакетов

# System requirements not met: macOS 13.0 or newer required
source: System requirements not met: macOS 11.0 or newer required
ru: Системные требования не выполнены: требуется macOS 11.0 или новее

source: This command requires root privileges
ru: Эта команда требует прав суперпользователя

source: Successfully %@
ru: Успешно %@

source: Failed to %@
ru: Не удалось %@
